Revit 2024 API
ExternalResourceReference Constructor (ExternalResourceReference)
 Creates a new ExternalResourceReference from the given ExternalResourceReference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceReference(
	ExternalResourceReference other
)
Visual Basic
Public Sub New ( _
	other As ExternalResourceReference _
)
Visual C++
public:
ExternalResourceReference(
	ExternalResourceReference^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExternalResourceReference
 The ExternalResourceReference to copy.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceReference Class
ExternalResourceReference Overload
Autodesk.Revit.DB Namespace